In [1]:
from sqlite3 import connect

In [3]:
# kết nối tới database myDatabase.db trong thư mục data
cn = connect('data/mydatabase.db')

In [4]:
# tạo cursor
cursor = cn.cursor()

In [5]:
# câu truy vấn tạo cấu trúc bảng
sql = """
Create Table NhanVien
(
    MaSo char(6) primary key,
    HoTen varchar(50),
    Tuoi int
)
"""
cursor.execute(sql)

In [6]:
# Thêm dữ liệu vào bảng NhanVien
sql = """
Insert into NhanVien(MaSo, HoTen, Tuoi)
Values ('A00001', 'Nguyễn Trần Lê', 25)
"""
cursor.execute(sql)

In [7]:
# Thêm dữ liệu vào bảng NhanVien
sql = """
Insert into NhanVien(MaSo, HoTen, Tuoi)
Values ('A00002', 'Trần Lê Nguyễn', 20)
"""
cursor.execute(sql)

In [8]:
# ghi nhận các thay đổi vào database
cn.commit()

In [12]:
sql = "Select * from NhanVien"
results = cursor.execute(sql)
for row in cursor:
    print(row)

('A00001', 'Nguyễn Trần Lê', 25)
('A00002', 'Trần Lê Nguyễn', 20)

In [13]:
sql = "Select * from NhanVien"
results = cursor.execute(sql)
data = cursor.fetchall()

In [15]:
import pandas as pd

In [17]:
df = pd.DataFrame(data, columns=['Maso', 'Hoten', 'Tuoi'])
df

     Maso           Hoten  Tuoi
0  A00001  Nguyễn Trần Lê    25
1  A00002  Trần Lê Nguyễn    20

In [18]:
df2 = pd.read_sql(sql, cn)
df2

     MaSo           HoTen  Tuoi
0  A00001  Nguyễn Trần Lê    25
1  A00002  Trần Lê Nguyễn    20

In [20]:
# Thêm 3 nhân  viên mới vào bảng NhanVien
sql = "Insert Into NhanVien(Maso, Hoten, Tuoi) Values(?,?,?)"

#dữ liệu truyền cho tham số
param_data = [
    ('A00003', 'Nguyễn Lê Trần', 22),
    ('A00004', 'Lê Nguyễn Trần', 23),
    ('A00005', 'Lê Trần Nguyễn', 27)
]
# thực thi câu truy vấn với 3 bộ dữ liệu
cursor.executemany(sql, param_data)
# ghi nhận các thay đổi vào database
cn.commit()

IntegrityError: UNIQUE constraint failed: NhanVien.MaSo

In [21]:
# Thêm 3 nhân  viên mới vào bảng NhanVien
sql = "Insert Into NhanVien(Maso, Hoten, Tuoi) Values(:ma, :ten, :tuoi)"

#dữ liệu truyền cho tham số
param_data = [
    {'ma': 'A00006', 'ten': 'Nguyễn Lê Trần', 'tuoi': 22},
    {'ten': 'Lê Nguyễn Trần', 'ma': 'A00007', 'tuoi': 23},
    {'ma': 'A00008', 'ten': 'Lê Trần Nguyễn', 'tuoi': 27}
]
# thực thi câu truy vấn với 3 bộ dữ liệu
cursor.executemany(sql, param_data)
# ghi nhận các thay đổi vào database
cn.commit()

## Sử dụng Magic SQL

In [10]:
# load thư viện
%load_ext sql

In [11]:
# kết nối tới tập tin database mydatabase.db
%sql sqlite:///data/mydatabase.db

In [12]:
# liệt kê tất cả nhân viên
%sql Select * from NhanVien

 * sqlite:///data/mydatabase.db
Done.

[('A00001', 'Nguyễn Trần Lê', 25), ('A00002', 'Trần Lê Nguyễn', 20)]

In [13]:
results = %sql Select * From NhanVien

 * sqlite:///data/mydatabase.db
Done.

In [14]:
df = results.DataFrame()
df

     MaSo           HoTen  Tuoi
0  A00001  Nguyễn Trần Lê    25
1  A00002  Trần Lê Nguyễn    20